# Яким Алексей ПИ17-1
#
# Требуется проанализировать информацию из двух разных баз данных. Каждая база данных
# содержит n числовых значений (так что общее количество значений равно 2n); будем
# считать, что одинаковых значений нет. Требуется вычислить медиану этого множества из
# 2n значений, которую мы определим как n-е значение в порядке возрастания. Однако доступ
# к информации затруднен — ее можно получить только при помощи запросов к базам данных.
# В одном запросе указывается значение k для одной из двух баз данных, и выбранная база
# данных возвращает k-е значение в порядке возрастания, содержащееся в этой базе. Так как
# обращения к базам занимают много времени, медиану хотелось бы вычислить с минимальным
# количеством запросов. Приведите алгоритм вычисления медианы с количеством запросов
# не более O(log n).

if __name__ == "__main__":
    pass
